{
  "id": 3,
  "title": "Accordion Pattern",
  "slug": "accordion-pattern",
  "excerpt": "Organizing and presenting content in collapsible sections.",
  "category": "UI Patterns",
  "tags": ["Layout", "Information Architecture"],
  "content": "<p>The accordion pattern is a graphical control element that expands and collapses to reveal or hide content. It's commonly used to organize complex content into manageable sections, making information easier to digest and navigate.</p><h2>Key Features</h2><ul><li><strong>Expandable sections:</strong> Each section can be expanded or collapsed independently.</li><li><strong>Space-saving:</strong> Allows for compact presentation of information.</li><li><strong>Progressive disclosure:</strong> Reveals information gradually, reducing cognitive load.</li></ul><h2>Best Practices</h2><ol><li><strong>Clear headers:</strong> Use descriptive, concise headers for each section.</li><li><strong>Visual cues:</strong> Provide clear indicators for expanded and collapsed states.</li><li><strong>Smooth animations:</strong> Use subtle animations for expanding and collapsing to enhance user experience.</li><li><strong>Keyboard accessibility:</strong> Ensure the accordion can be navigated and operated using keyboard controls.</li><li><strong>Default state:</strong> Consider whether sections should be collapsed or expanded by default based on user needs.</li></ol><h2>Use Cases</h2><ul><li>FAQs and help documentation</li><li>Product specifications or features</li><li>Navigation menus on mobile devices</li><li>Settings or preferences panels</li></ul><p>The accordion pattern is particularly useful when you have a large amount of related content that needs to be organized in a compact, easily navigable format. However, be cautious not to overuse accordions, as they can sometimes hide important information from users.</p>",
  "thumbnail": "/images/accordion-thumb.jpg",
  "heroImage": "/images/accordion-hero.jpg",
  "emoji": "🪗",
  "backgroundColor": "#FFB6C1"
}